<script setup lang="ts" generic="T extends any, O extends any">
defineOptions({
  name: 'IndexPage',
})
const appName = '回啥'
</script>

<template>
  <div class="protocol">
    <div class="bt" style="text-align: center">
      {{ appName }}隐私政策
    </div>
    您通过移动应用使用{{ appName }}时，可能会涉及我们对您信息的收集和使用。本隐私政策说明您在通过移动应用访问和使用我们的服务时，{{ appName }}如何收集、使用和披露您的信息。了解本隐私政策以及您如何保护自己的信息非常重要，请您仔细阅读。
    <br>
    <div class="bt">
      1. 本隐私政策的适用范围
    </div>
    1.1 使用{{ appName }}即表示您同意我们按照本隐私政策及其不时修订的版本访问、收集、使用和共享您的信息。此外，您使用{{ appName }}即表示您同意本隐私政策的条款。如果您不同意本隐私政策的条款，请不要使用{{ appName }}。
    <br><br>
    1.2 本隐私政策构成您为使用{{ appName }}而同意的{{ appName }}服务条款的一部分。除非本隐私政策另有定义或上下文另有要求，本隐私政策中使用的术语与{{ appName }}服务条款中的对应定义具有相同含义。除本隐私政策另有说明外，{{ appName }}服务条款中的相关条款同样适用于本隐私政策。
    <br><br>
    1.3 我们收集的任何信息均适用收集该等信息时生效的隐私政策。我们可能会不时修改和更新本隐私政策。如果我们对本政策作出我们认为属于重大变更的修改，无论是否另行通知，您继续使用服务即表示您同意受修订后政策的约束。
    <br><br>
    1.4 {{ appName }}可能会向您提供由第三方提供的社交媒体或其他功能或服务链接，包括网站、插件和组件。请注意，本隐私政策不适用于您通过我们的服务访问的任何第三方网站、服务或应用所收集的信息，也不适用于在{{ appName }}上推广其服务的其他公司和组织所收集的信息。对于您向第三方提供的信息被第三方如何使用，我们不承担责任。
    <br><br>
    2. 在向您提供{{ appName }}服务时，我们会通过下述方式获取与您有关的信息。请注意，为了向您提供{{ appName }}服务，我们需要某些类型的信息。
    <br><br>
    1). 用户提供的信息
    <br><br>
    2). 基于合法权益自动收集的信息
    <br><br>
    用户提供的信息
    <br><br>
    1) 您开通{{ appName }}账户时向我们提供的信息，包括昵称、性别、出生日期、国家或地区、年龄、电子邮箱、密码、社交媒体账号信息（头像、视频）以及您发布的个人标签；
    <br><br>
    2) 您在{{ appName }}个人资料中向其他{{ appName }}用户可见的信息，或您在使用{{ appName }}过程中向我们提供的信息，可能包括您的照片、性别等；
    <br><br>
    3) 用户生成内容（“UGC”），例如您在使用{{ appName }}服务时通过应用上传、分发或传播的评论、文本、消息、图片、图像、视频、声音、代码或其他数据和材料；
    <br><br>
    4) 支付信息，例如银行账号、Paypal或其他用于支付的信息；
    <br><br>
    5) 您购买付费服务后的交易信息，例如交易编号和交易记录；
    <br><br>
    6) 您的授权选择以及与我们的沟通信息，例如用于验证账户、处理反馈或投诉的信息，以及您参与应用内问卷和活动时提供的信息。
    <br><br>
    7) 当您通过连接或关联第三方社交媒体账号（例如 Facebook、Google）创建{{ appName }}账户时，您通过社交媒体向我们提供的信息；
    <br><br>
    2. 基于合法权益自动收集的信息
    <br><br>
    ⊙ 其他服务账号相关数据：如果您的社交媒体或其他在线账号与您在我们服务中的账号相关联，我们可能会通过这些账号获取部分信息。如果您通过 Facebook 或其他第三方平台登录我们的服务，我们会请求您授权访问该第三方账号的部分信息。例如，根据平台或服务的不同，我们可能会收集您的姓名、头像、性别信息和出生日期，包括来自 Google 的 Google 账号唯一 ID、ID token，以及来自 Facebook 的 AccessToken。这些平台和服务会通过其接口向我们提供信息。我们收到的信息取决于您决定向我们提供的信息（通过您的隐私设置）或相关平台/服务的规则。如果您通过第三方平台或服务访问或使用我们的服务，或点击任何第三方链接，您的数据收集、使用和共享也将受该第三方隐私政策及其他协议约束。
    <br><br>
    ⊙ 设备标识符，例如您的操作系统、浏览器类型、品牌、型号和移动设备序列号、互联网协议（IP）地址、移动运营商、屏幕分辨率、语言设置、IMEI号、IMSI号以及媒体访问控制地址；
    <br><br>
    ⊙ 网络活动信息，例如您的浏览记录、搜索记录、访问过的视频或页面、访问日期和时间、您订阅的其他用户账号，以及您与其他用户互动的信息；
    <br><br>
    ⊙ 当服务崩溃或卡顿时，我们也会收集错误报告信息，以便调查错误并提升后续版本的服务稳定性。通常情况下，这些报告不包含可识别个人身份的信息，或仅偶然包含。作为错误报告的一部分，我们会收到您的设备类型和版本、设备标识符、错误发生时间、正在使用的功能以及错误发生时应用的状态。我们不会将这些信息用于调查和修复错误之外的任何目的。
    <br><br>
    ⊙ 您访问和使用其他应用的信息；
    <br><br>
    ⊙ 与您向我们提供的 UGC 相关的元数据。元数据用于描述其他数据，并提供有关 UGC 片段如何、何时、由谁收集以及其格式的信息，例如用于标记视频关键词的主题标签和字幕；
    <br><br>
    我们也可能收集、使用和共享您的信息，以生成和分享不会识别您身份的汇总洞察。汇总数据可能来源于您的个人信息，但由于该数据不能直接或间接识别您的身份，因此不被视为个人信息。例如，我们可能汇总您的使用数据，用于计算访问特定站点功能的用户比例、生成用户统计数据，或计算广告展示和点击次数。
    <br><br>
    <div class="bt">
      2. 关于敏感个人信息的特别说明
    </div>
    为提供某些功能（例如在线视频通话），我们需要在获得您许可后访问您的麦克风、摄像头，具体如下：
    <br><br>
    1) 麦克风：我们会在获得您许可后访问您设备上的麦克风，用于录制语音消息并在视频通话中传输声音。
    <br><br>
    2) 摄像头：我们会在获得您许可后访问您设备上的摄像头，用于拍摄头像并在视频通话中传输实时画面。
    <br><br>
    使用{{ appName }}即表示您同意我们按照本隐私政策所述目的和方式处理敏感个人信息。
    <br><br>
    请注意，除非取得您的同意，我们不会将您的敏感个人信息用于直接营销目的。
    <br><br>
    2.3 关于儿童信息的特别说明：{{ appName }}服务仅适用于年满18周岁的用户。我们不允许未满18周岁的用户访问我们的平台，也不会故意收集未满18周岁用户的个人信息。
    <br><br>
    <div class="bt">
      3. 我们如何使用收集的信息
    </div>
    我们仅在以下情形下使用或披露您的个人信息：验证您的身份；
    <br><br>
    1) 通过服务帮助您与他人建立联系；
    <br><br>
    2) 在服务中与他人共享您的个人信息；
    <br><br>
    3) 允许您使用我们不时提供的某些服务功能。向您展示正在与您沟通的人员姓名，并在服务中展示您正在沟通的人员姓名；
    <br><br>
    4) 向您发送与您使用服务相关的管理通知、提醒和沟通信息；
    <br><br>
    5) 根据您允许我们收集的信息，或您向与{{ appName }}账户关联的社交媒体服务提供方提供的信息，向您提供您请求的相关内容，例如您的位置以及您的{{ appName }}联系人位置相关信息；
    <br><br>
    6) 通过电子邮件、短信或其他方式联系您，通知您有关新产品、服务或促销的信息；用于内部运营，包括故障排查、数据分析、测试、研究、服务改进，以及检测和防范错误、欺诈或其他违法活动；
    <br><br>
    7) 当我们真诚地认为法律、任何法律程序、执法、国家安全或公共利益事项要求披露时；为保护和维护我们的权利或财产（包括执行我们的使用条款和其他协议）时；或
    <br><br>
    8) 与涉及{{ appName }}的公司交易相关时，例如业务部门买卖、收购、合并、资产出售或其他类似事件。
    <br><br>
    {{ appName }}允许您在{{ appName }}应用中与其他用户分享文本消息、照片、截图、视频和其他通信内容。如果您选择这样做，您的文本消息、照片、截图、视频和其他通信内容将被存储在我们的服务器上。此外，如果您选择与其他{{ appName }}用户分享这些内容，我们可能无法从服务器中移除它们，也可能无法使您已分享对象无法访问这些内容。在{{ appName }}应用中发送和分享文本消息、照片、截图、视频或其他通信内容由您自行决定。选择分享该等信息时，您应理解您可能不再能够控制该信息如何被使用，并且该信息可能会公开可见（部分取决于您的行为或您分享对象的行为）。{{ appName }}不对您分享信息的任何使用或误用承担责任。
    <br><br>
    3.2 传输和存储
    <br><br>
    我们在全球多个司法管辖区运营并可能继续运营服务器，因此使用和存储您个人信息的服务器可能不在您所在的司法管辖区。
    <br><br>
    您同意我们为本隐私政策所述目的传输您的个人信息，包括在您所在司法管辖区内外进行传输。
    <br><br>
    3.3 分析
    <br><br>
    我们使用您信息的主要原因是提供和改进我们的服务。此外，我们也会使用您的信息帮助保障您的安全。以下进一步说明我们使用您信息的不同原因及相关示例。
    <br><br>
    1) 第三方使用分析工具：我们在服务中使用 Google Inc（1600 Amphitheatre Parkway, Mountain View, CA 94043, USA，“Google”）提供的工具进行使用情况分析。由 Firebase 拥有并被 Google 收购的工具用于衡量使用情况。由 Google 运营的 Firebase 也用于使用情况分析目的。
    <br><br>
    2) 第三方转化跟踪工具：AppsFlyer、Google 转化跟踪 API 和 Facebook 转化跟踪 API 用于用户转化跟踪。
    <br><br>
    3) 崩溃检测工具：我们使用 Firebase 旗下的 Crashlytics 工具进行崩溃检测。该工具有助于维护和改进服务。您的所有崩溃数据均以匿名方式收集。
    <br><br>
    3.4 共享您的信息
    <br><br>
    您的信息会以下列方式与他人共享：在我们的产品中共享
    <br><br>
    1) 未经您同意，我们不会向第三方（或{{ appName }}所属的公司集团）出租或出售您的信息，除非本隐私政策另有说明。我们可能会与以下对象共享您的信息：
    <br><br>
    2) 我们可能会与{{ appName }}公司集团中依法属于同一集团的企业（“关联方”）共享用户内容和您的信息，包括但不限于来自 Cookie、日志文件、设备标识符、位数据和使用数据的信息。关联方可使用这些信息帮助提供、理解和改进服务（包括通过提供分析）以及其自身服务（包括为您提供更好、更相关的体验）。但这些关联方将尊重您关于谁可以查看您内容的选择。
    <br><br>
    3) 我们也可能与帮助我们向您提供服务的第三方组织（“服务提供商”）共享您的信息以及来自 Cookie、日志文件、设备标识符和位置数据等工具的信息。我们的服务提供商将在合理的保密条款约束下访问您的信息，以便提供服务。
    <br><br>
    4) 我们也可能与第三方共享汇总或匿名信息，包括广告商和投资者。例如，我们可能会告知广告商我们的应用获得了多少用户。该信息不包含任何个人信息或可识别个人身份的信息，并用于开发我们希望您感兴趣的内容和服务。
    <br><br>
    5) 我们可能会删除部分可识别您身份的数据，并与其他方共享经过处理的数据。我们也可能以不再与您关联的方式将您的信息与其他信息结合，并共享该汇总信息。您可以选择与哪些对象共享您的用户内容：
    <br><br>
    6) 您自愿披露并发布到服务中的任何信息或内容（例如用户内容）将向公众开放。您一旦分享用户内容或将其公开，该用户内容可能会被他人再次分享；
    <br><br>
    7) 如果您删除在服务中创建的信息和内容（例如截图等），相关副本可能仍会在服务缓存和归档页面中可见，或在其他用户或第三方（例如 Facebook 等）已复制或保存该信息的情况下继续存在。
    <br><br>
    3.5 我们为保护您的信息采取的安全措施
    <br><br>
    我们采用管理、物理和电子措施保护您的信息免遭未经授权的访问。然而，尽管我们作出努力，没有任何安全措施是完美或不可突破的，也没有任何数据传输方式能够保证完全避免拦截或其他形式的滥用。如果因安全事件导致您的个人信息受到损害，我们将按照适用法律要求及时通知您。
    <br><br>
    当我们与任何第三方共享您的个人信息时，我们将尽合理努力确保该等第三方仅按以下方式使用您的个人信息：
    <br><br>
    (i) 遵守本隐私政策；
    <br><br>
    (ii) 遵守我们向其提供的其他指示，包括我们实施的任何适当保密和安全措施。
    <br><br>
    <div class="bt">
      4. 如何访问您的信息
    </div>
    您可以通过您的账户访问和修改您向我们提供的信息。
    <br><br>
    如果您认为您发布在{{ appName }}上的信息不真实或不准确，并能够向我们提供合理证明，您可以通过本隐私政策中提供的联系方式要求我们更正这些不真实或不准确的信息，我们将尽合理努力满足您的请求；但我们可能会根据法律要求和/或出于记录保存目的保留您信息的归档副本。
    <br><br>
    一旦您的账户被关闭或删除，您将无法再访问您的消息历史、偏好设置或与您使用我们服务相关的任何其他信息。即使您从账户或个人资料中移除信息，该信息的副本仍可能在其他地方可见，例如该信息已与他人共享、已根据您的隐私设置以其他方式分发，或已被其他用户复制或保存。此外，在您关闭账户后，如果为遵守法律义务（包括执法请求）、满足监管要求、解决争议、维护安全、防止欺诈和滥用，或执行服务条款而有合理必要，我们仍会保留您的个人数据。账户关闭后，我们也会保留去标识化信息。
    <br><br>
    在某些情况下，我们可能无法更新、修改或删除您的个人信息。届时我们会告知您无法处理的原因，例如某些请求可能需要不成比例的技术投入、极不现实，或受到法律禁止。
    <br><br>
    由于{{ appName }}将在多个司法管辖区使用，我们可能无法识别本隐私政策某些条款与您所在司法管辖区适用法律之间的所有不一致之处。因此，您同意在发现此类不一致时通知我们。在此情况下，我们将采取必要措施消除此类不一致，包括删除我们不当收集或使用的个人信息。
    <br><br>
    <div class="bt">
      5. 数据访问和删除
    </div>
    您始终可以控制您选择在服务中与我们共享的信息。为此，您可以更改服务中或移动设备上的设置。您也可以从移动设备中完全删除本服务，并可随时删除您的数据。如果您要求我们删除您的账户，我们将以商业上合理的努力从服务器中删除您的数据。
    <br><br>
    您在{{ appName }}应用中或通过该应用与其他用户共享的文本消息、照片、视频或任何其他可识别个人身份的信息，或您在我们网站或其他地方的博客、公告板或聊天室中提交的信息，可能会被他人查看和使用，包括向您发送未经请求的消息或进行身份盗用。对于因您披露信息而导致的信息使用或误用，{{ appName }}不承担责任。
    <br><br>
    <div class="bt">
      6. 安全
    </div>
    保护用户隐私和个人信息是{{ appName }}的首要事项。我们会作出重大努力，确保您向我们提供的所有可识别个人身份信息的隐私安全。对所有可识别个人身份信息的访问仅限于为提供、运营、开发、维护和支持服务而需要了解该等信息的{{ appName }}员工、承包商、代理人和第三方服务提供商。
    <br><br>
    <div class="bt">
      7. 年龄
    </div>
    本服务不面向未满十八（18）周岁的儿童，我们不会在服务中故意接收或出售未满十八周岁儿童的可识别个人身份信息。如果我们发现自己在服务中无意接收了未满18周岁用户的可识别个人身份信息，我们会从记录中删除该等信息。如果我们未来改变相关做法，在收集未满18周岁儿童的任何可识别个人身份信息之前，我们将事先取得可验证的父母同意。
    <br><br>
    <div class="bt">
      8. 变更通知
    </div>
    我们保留自行决定变更本隐私政策的权利。您可以随时通过我们网站上的链接查看隐私政策更新。您同意接收{{ appName }}电子通知和/或修订后的隐私政策，并同意该等电子通信或发布构成对您的隐私政策通知。我们保留不时修订本政策的权利，请您经常查看。如果我们对本政策作出重大变更，我们将通过发布修订后的隐私政策、在网站上发布通知或根据法律要求的其他方式通知您。您同意定期查看隐私政策，以便了解任何变更。您同意，在我们发布修订后的隐私政策或在网站上提供通知后，您继续使用服务即表示您接受修订后的隐私政策。如果您不同意隐私政策条款，请不要使用本服务。
    <br><br>
    <div class="bt">
      9. 联系我们
    </div>
    如果您对我们的隐私政策或任何隐私相关事项有疑问，请通过电子邮箱【{{ appName }}@{{ appName }}.site】联系我们。
    <br><br>
  </div>
</template>

<style scoped>
  .protocol {
    font-size: 14px;
    margin-bottom: 14px;
    color: #000;
    margin-left:6px;
    margin-right:6px;
    background-color: fff;
  }
  .bt {
    font-size: 20px;
    margin: 6px 0px;
    color: #7f1146;
  }
</style>
