<script setup lang="ts" generic="T extends any, O extends any">
defineOptions({
  name: 'IndexPage',
})
const appName = '回啥'
</script>

<template>
  <div class="agreement">
    <div class="T_title" style="text-align: center">
      {{ appName }}用户协议
    </div>
    <div class="T_content">
      我们在此提示您，在注册前请仔细阅读并充分理解本用户协议（以下简称“本协议”）。

      为明确各方权利义务，保护各方合法权益，特制定本协议。本协议中以加粗、下划线等方式特别标识的内容，请您重点关注。请确保您已充分理解本协议。除非您接受本协议全部内容，否则您无权注册、登录或使用我们的服务或软件（以下简称“服务”“软件”）。您的注册、登录、使用等行为将被视为您接受本协议，并同意受本协议约束。

      我们保留自行决定随时变更、修改、增加或删除本协议、补充协议、隐私政策、管理规定或功能条款部分内容的权利，并可通过在软件或服务内发布修订版本的方式进行，无需事先通知。若您不同意这些条款或未来任何修订版本，则不得访问或使用我们的服务。否则，您访问或使用我们的服务将被视为同意其未来更新版本。
    </div>
    <div class="T_title">
      1. 账户
    </div>
    <div class="T_content">
      1.1 为使用我们的服务，我们可能会要求您创建账户，或向您分配账户（以下简称“账户”）。我们可以调整账户注册方式。
      <br><br>
      1.2 您同意在注册本账户时，同时授权我们为公司其他服务开通账户。具体产品以我们的实际运营情况为准。
      <br><br>
      1.3 账户所有权归我们所有，您仅享有账户使用权。您不得赠与、出借、出租、转让或出售账户。
      <br><br>
      1.4 您有责任维护账户安全。如果因您保管不当导致账户被入侵或密码被盗，您应承担全部责任。我们将通过您账户实施的所有行为视为由您本人实施，因此您应对使用您账户进行的所有行为负责。如果您发现任何实际或疑似未经授权使用您账户或账户密码的情况，请立即通知我们。您同意在任何情况下均不得使用其他用户的账户或密码。
      <br><br>
      1.5 您应遵守本协议条款，并正确、适当地使用本软件。如您违反本协议任一条款，我们保留中止或终止向您提供服务的权利。
      <br><br>
      1.6 如果您连续一年未对账户进行任何操作，为避免资源浪费，我们有权在不事先通知的情况下删除或收回该账户，由此产生的全部风险由您自行承担。同时，我们保留自行决定随时删除或收回您的账户及用户名的权利。
      <br><br>
    </div>
    <div class="T_title">
      2. 服务范围
    </div>
    <div class="T_content">
      2.1 本软件的具体服务将根据实际情况提供，包括但不限于视频聊天、购买或赠送虚拟礼物。我们可自行决定随时修改所提供的服务，且无需事先通知您。
      <br><br>
      2.2 您理解并同意，出于商业目的，我们有权通过电子邮件、客户端、推送消息、短信、网页或其他合法方式向您发送促销或其他相关商业信息、通知。由于移动通信网络的特殊性，我们有权访问您的移动设备相关信息。
      <br><br>
    </div>
    <div class="T_title">
      3. 用户信息保护
    </div>
    <div class="T_content">
      3.1 在注册账户或使用服务过程中，您可能需要填写或提交某些必要信息，例如法律、法规及监管文件（以下简称“法律法规”）要求的身份信息。如果您提交的信息不完整、不准确或不符合法律法规，您可能无法使用或会被限制使用我们的服务。
      <br><br>
      3.2 为提供服务并提升本软件和技术质量，我们可能会收集或使用您的信息，或向第三方披露相关信息。更多详情请仔细阅读我们的《隐私政策》。
    </div>

    <div class="T_title">
      4. 内容要求和使用规则
    </div>
    <div class="T_content">
      4.1 本协议所称内容，是指您创建、上传、复制、发布和传播的任何内容，包括但不限于账户头像、名称、个人简介等注册信息和认证资料，或您发送、回复、自动回复的文字、音频、图片、视频、图形及相关链接页面，以及您使用本软件过程中产生的其他内容。
      <br><br>
      4.2 您不得使用本软件制作、上传、复制、发送以下内容，或实施以下行为：
      <br><br>
      1) 危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一的；
      <br><br>
      2) 损害国家荣誉和利益的；
      <br><br>
      3) 煽动民族仇恨、民族歧视，破坏民族团结的；
      <br><br>
      4) 破坏国家宗教政策，宣扬邪教和封建迷信的；
      <br><br>
      5) 散布谣言，扰乱社会秩序，破坏社会稳定的；
      <br><br>
      6) 传播淫秽、色情，包含性或性暗示内容的；
      <br><br>
      7) 传播赌博、暴力、凶杀、恐怖内容的；
      <br><br>
      8) 侮辱或诽谤他人，侵害他人合法权益或存在欺诈的；
      <br><br>
      9) 包含侮辱、恐吓或威胁内容的；
      <br><br>
      10) 包含骚扰、垃圾信息、恶意信息或钓鱼信息的；
      <br><br>
      11) 披露或涉及他人隐私、个人信息或资料的；
      <br><br>
      12) 侵犯他人名誉权、肖像权、知识产权、商业秘密等合法权利的；
      <br><br>
      13) 以任何方式损害未成年人利益的；
      <br><br>
      14) 跟踪或以其他方式骚扰其他用户的；
      <br><br>
      15) 包含虚假信息，或盗用他人头像、资料，冒用他人身份发布或使用的；
      <br><br>
      16) 强制、诱导其他用户关注、点击链接页面或分享信息的；
      <br><br>
      17) 捏造事实、隐瞒真相以误导或欺骗他人的；
      <br><br>
      18) 包含广告或销售导向信息的；
      <br><br>
      19) 使用技术手段批量创建虚假账户的；
      <br><br>
      20) 删除本软件及其副本上的版权信息的；
      <br><br>
      21) 对本软件进行反向工程、反向编译、反编译，或试图发现本软件源代码的；
      <br><br>
      22) 使用、出租、出借、复制、修改、链接、转载、汇编、发布，或为包含本公司知识产权的内容创建镜像站点的；
      <br><br>
      23) 复制、修改、增加、删除、挂接我们发布或软件运行所必需的任何数据，或制作其衍生作品的；
      <br><br>
      24) 增加、删除、改变软件功能，或通过修改、伪造软件运行中的指令和数据向公众运营或传播本软件的，无论是否出于商业目的；
      <br><br>
      25) 通过非我们开发或授权的第三方软件、黑客工具、插件或系统登录或使用本软件，或创建、发布、传播非公司开发或授权的第三方软件、插件、黑客工具和系统的；
      <br><br>
      26) 具有冒犯性、不雅或可能被合理认为令人反感的；
      <br><br>
      27) 其他违反法律法规、监管文件和政策（包括您所在地、本软件运营或运行所在地的规定），侵犯第三方合法权益，或干扰本软件正常运行的内容或行为。我们将审核您上传的内容，并在上传后24小时内发送审核结果。如果您使用本应用制作、上传、复制、发布和传播上述内容，我们有权删除您发送的内容；如存在严重违规，我们将封禁账户。
      <br><br>
      4.3 您制作、上传、复制和发送的任何内容均与我们无关，也不反映或代表我们的意见、立场或政策。对于您上传、传播、复制、发布的任何内容，或您实施的任何行为，我们不承担任何责任。
      <br><br>
      4.4 您应对自己传输、制作、上传、复制、发布、传播的信息及所实施行为的真实性、合法性、准确性和有效性独立负责。任何责任均由您自行承担，与本软件无关。如因您的行为给我们或第三方造成损害，您应赔偿我们或第三方的损失，我们有权依据本协议追究您的责任。
      <br><br>
    </div>
    <div class="T_title">
      5. 第三方产品和服务
    </div>
    <div class="T_content">
      5.1 本服务可能包含第三方提供的广告和推广内容，您同意在使用服务过程中展示该等广告和推广内容。除法律法规另有明确规定外，您应自行对根据广告信息进行的交易及与交易相关的损失负责。我们不对上述交易产生的任何责任或损失承担责任。
      <br><br>
      5.2 如果您选择使用本软件展示或链接的第三方服务、产品，您应遵守第三方关于您行为的协议和政策。我们无法保证第三方服务的安全性、准确性和有效性，也不对您因第三方服务、产品或行为产生的损失承担责任。
    </div>
    <!-- <div class="T_title">
      6. 会员
    </div>
    <div class="T_content">
      6.1 您可以购买会员服务，会员包含的服务内容和价格信息以本服务相关页面展示为准。
      <br><br>
      6.2 我们可以随时通过在相关页面展示修订版本的方式调整会员服务收费标准和内容。
      <br><br>
      6.3 除法律法规明确规定外，您支付成功后不得转让或退款。如果您未在付费服务规定的有效期内使用我们的服务，订阅到期后服务将自动终止，且不能中断或延期。
      <br><br>
      6.4 您注册会员时提交的内容和个人资料必须有效、真实。必要时您应修改已注册的个人资料，否则因会员权益无法充分、有效行使而产生的任何后果由您自行承担。
      <br><br>
    </div>
    <div class="T_title">
      7. 订阅和虚拟货币
    </div>
    <div class="T_content">
      7.1 订阅
      您可以按一个月、两个月或三个月购买不同订阅套餐。对于所有移动端订阅，当您确认购买时，费用将从您的 iTunes 或 Google 账户中扣除。除非您在当前订阅期结束前至少24小时关闭自动续订功能，否则订阅将自动续订。这是因为您的账户可能会在当前订阅期结束前24小时内被扣取续订费用。您可以通过访问 iTunes 或 Google 账户设置来管理订阅并关闭自动续订。订阅期内您不能取消当前订阅，但可以随时取消自动续订。
      <br><br>
      订阅购买后不可退款且不可转让，即使订阅到期或停止亦是如此。我们可能随时更改订阅购买价格及订阅包含的功能。我们保留随时停止发布和提供订阅并设置订阅到期日期的权利。订阅不能兑换任何金额或货币价值。
      <br><br>
      7.2 虚拟货币
      当您购买或获得钻石等虚拟货币产品时，您并不拥有其所有权。钻石可用于上传动态、使用滤镜和视频聊天功能等。您同意，我们因行使与金币及其他虚拟货币相关的权利而不对您承担责任。我们保留核验您身份及使用虚拟货币资格的权利。
      <br><br>
      如果我们修改、暂停或终止虚拟货币或动态功能，或因任何服务错误或其他原因造成损失或损害，我们不负责修复或替换虚拟货币，也不向您提供任何抵扣或退款。虚拟货币购买后不得再授权，且不可退款、不可转让，即使其到期、被撤销或停止使用亦是如此。我们可能随时更改虚拟货币的购买价格以及您使用虚拟货币的方式。我们保留在不通知、不退款、不补偿的情况下随时撤销或停止发行虚拟货币，并设置虚拟货币到期日期的权利。虚拟货币不得兑换任何金额或货币价值。如果您删除账户或账户因任何原因被终止，您将失去所有已累积且未使用的虚拟货币，且不获得退款或其他补偿。您同意，我们因行使与虚拟货币相关的权利而不对您承担责任。任何用户购买或获得的虚拟货币均不构成财产，且不可转让。
      <br><br>
      7.3 支付方式
      我们的付费服务
      我们的付费服务可通过某些第三方账户购买，例如您的 Apple iTunes 账户或 Google Play 账户（“第三方账户”）。如果您通过第三方账户购买任何付费服务，该等付费服务的账单将通过您的第三方账户显示。您应查看第三方账户的服务条款，我们无法控制该等条款。
      <br><br>
      7.4 取消订阅
      如果您通过第三方账户购买订阅，您需要通过该第三方并按照该第三方的服务条款取消订阅。如果您取消订阅，您的订阅权益将持续到当期订阅期限结束，但该期限届满后不会续订。对于当期订阅期限已支付订阅费用的任何部分，您无权获得按比例退款。
      <br><br>
      7.5 期限/费用
      在您使用移动应用、网站和/或服务期间，本协议持续有效。我们可出于任何原因随时终止您的会员资格，且无需通知。如果我们终止您在服务中的会员资格，您无权获得任何未使用订阅费用的退款（如有）。即使会员资格终止，本协议仍然有效。我们在您注册时向您提供的服务条款和/或订阅费用（如有）可能会根据需要变更。通过使用服务并成为会员，您确认我们保留对服务收费的权利，并有权在会员违反本协议或未按本协议要求支付必要服务费用时终止会员资格。短信、彩信和其他数据的标准使用费用可能适用，并可能计入您的无线服务账单或从您的预付余额中扣除。
      <br><br>
    </div> -->
    <div class="T_title">
      6. 数据存储
    </div>
    <div class="T_content">
      6.1 对于您在本服务中的数据被删除或存储失败，我们不承担责任。
      <br><br>
      6.2 我们可以根据各种因素确定您在服务中数据的最长存储期限和存储空间。您可以根据自身需要备份本服务中的相关数据。
      <br><br>
      6.3 如果您停止使用服务，或服务被终止或结束，我们可以从服务器中永久删除您的数据，且无义务向您返还任何数据。
      <br><br>
      6.4 您可以修改或删除您的个人资料、注册信息以及您上传、传播的内容。请注意，删除相关信息将导致系统中存储的内容被删除。您应自行承担该风险。
      <br><br>
    </div>
    <div class="T_title">
      7. 风险
    </div>
    <div class="T_content">
      7.1 您理解并同意，本软件仅为您提供信息分享、传输的平台。您应对账户下的所有行为负责，包括您传输的任何内容及由此产生的任何后果。您应自行判断本软件和服务中的内容，并承担使用服务产生的全部风险，包括因依赖内容的正确性、完整性或有用性而产生的风险。我们不能也不会对您的行为造成的任何损失承担责任。
      <br><br>
      7.2 如果您发现任何人违反本协议或以其他不当方式使用服务，请立即告知我们，我们将依据本协议进行处理。
      <br><br>
      7.3 您理解并同意，我们保留根据各种因素自行决定变更、暂停、终止或更新服务全部或任何功能的权利，且无需事先通知。
      <br><br>
    </div>
    <div class="T_title">
      8. 知识产权
    </div>
    <div class="T_content">
      8.1 您确认，与我们的服务相关的知识产权（由广告商贡献并拥有的内容除外）归我们所有，除非您在使用我们的服务前已合法取得您在本软件上发布内容的知识产权。
      <br><br>
      8.2 除另有规定外，本软件的著作权、专利权及其他知识产权归我们所有。
      <br><br>
      8.3 服务中涉及的图形、文字或其组成部分，以及其他软件标识、产品和服务名称（以下简称“软件标识”）的著作权或商标权归我们所有。未经我们事先书面同意，您不得以任何方式展示或使用软件标识，也不得向他人表示您有权展示、使用或以其他方式修改软件标识。
      <br><br>
      8.4 上述以及我们或相关广告商拥有的任何其他知识产权均受法律保护。未经我们或相关广告商书面许可，您不得以任何形式使用或创作衍生作品。
      <br><br>
      8.5 除公司与您/您的代理人另有书面约定外，您拥有您上传的文字、图片、视频、音频、照片等内容相关的知识产权；同时，您同意授予我们及我们的关联方一项不可撤销、永久、独占、免许可费、全球范围内且可再许可的权利，用于商业或非商业目的使用、展示和复制上述内容，包括但不限于改编、展示、播放、出租、复制、拍摄、翻译，或将该等内容发布到互联网。我们可自行决定是否使用及使用方式，包括但不限于在我们运营的任何平台上使用和传播上述信息、编辑上述信息，以及授权第三方使用、编辑、传播。
    </div>
    <div class="T_title">
      9. 责任
    </div>
    <div class="T_content">
      9.1 如果您存在违法、违规、违约或侵权行为，我们有权自行决定采取以下任何或全部措施：给予警告、限制您使用部分功能、终止您访问本软件、将您加入黑名单、公布您的违约行为、部分或全部扣除、冻结虚拟物品和虚拟收益。如果我们决定终止您的账户或将您加入黑名单，我们有权不退还您的虚拟物品和收益。 <br><br>
      9.2 您理解并同意，我们有权针对您的违法、违规、违约、侵权行为采取任何补救措施或适当法律行动，并依法向主管机关披露相关信息，由此产生的全部后果由您承担。
      <br><br>
      9.3 您理解并同意，因您违反本协议而产生的任何第三方损失、损害或索赔，应由您承担，包括合理的律师费。
      <br><br>
      9.4 您同意赔偿、抗辩并使我们及我们的关联方免受因您访问或使用服务、违反本协议而引起的任何及全部投诉、要求、索赔、损害、损失、成本、责任和费用，包括但不限于律师费。
      <br><br>
      9.5 我们有权选择单独或合并适用上述补救措施。
      <br><br>
    </div>
    <div class="T_title">
      10. 不可抗力及其他免责声明
    </div>
    <div class="T_content">
      10.1 您理解并确认，在使用服务过程中，您可能遇到超出我们控制范围的问题，导致服务中断。对于超出我们控制和预期范围的服务暂停、问题或损失，我们不承担责任，例如洪水、地震、瘟疫、风暴等自然灾害，以及战争、动乱、政府行为等社会事件。发生上述事件时，我们将尽力配合并及时修复。
      <br><br>
      10.2 我们不承诺或保证服务始终安全、可靠、可用、不中断、无错误或无延迟。在适用法律允许的范围内，我们不就服务作出任何形式的明示或默示保证、条件或其他条款。我们不承担任何权利保证或关于不侵权、适销性、安宁使用或特定用途适用性的默示保证、条件或其他条款。我们不控制或操纵您及他人的行为，也不对其任何内容（无论线上或线下）及其分享的任何内容负责，包括冒犯性、不雅、淫秽、违法或其他有争议的内容。
      <br><br>
      10.3 与大多数互联网服务一样，我们的服务可能受到各种安全问题影响，包括但不限于互联网服务质量、社会环境，以及您下载、安装、访问的其他软件或网站可能包含“木马”等病毒，威胁您的计算机信息和数据安全，进而影响服务的正常使用。您应加强信息安全和用户数据保护，并注意加强密码保护，以避免损失和骚扰。
      <br><br>
      10.4 您理解并确认，服务可能因不可避免的问题、计算机病毒或黑客攻击、系统不稳定、您所在位置、您关机，以及其他技术问题、互联网问题、电信运营问题等发生中断。对于上述中断造成的任何损失，我们不承担责任。
      <br><br>
      10.5 您理解并确认，在使用服务过程中，可能存在误导性、欺骗性、威胁性、诽谤性、冒犯性或违法信息，或侵犯他人权利的信息。对于上述信息或行为导致您或任何第三方遭受的任何损失，我们不承担任何责任。
      <br><br>
      10.6 您理解并确认，我们可能定期或不定期维护、更新和修复本软件或其功能。如因此类情况并在事先通知后导致服务在合理时间内中断，我们不承担责任。
      <br><br>
      10.7 除法律法规另有规定外，对于任何第三方的违约、侵权、违法行为，我们有权但无义务处理，且无法保证上述第三方违约、侵权、违法行为能够被及时发现和处理。
      <br><br>
      10.8 您理解并确认，对于向您提供的产品或服务质量缺陷，以及赠送给您的免费产品或服务造成的任何损害，我们不承担责任。
      <br><br>
      10.9 尽管本协议另有规定，您确认，对于因使用或无法使用服务，或因第三方行为（包括服务的其他用户和外部网站运营者）而以任何方式产生的任何间接、附带、特殊、惩罚性或后果性损害，包括利润、商誉或数据损失，我们不承担责任。此外，无论以何种方式、基于何种原因产生的全部赔偿、补救和责任，均不超过您向我们支付的全部费用（如适用）。
      <br><br>
      10.10 您确认并理解，如果您在线下或平台外与其他用户见面、交易，可能存在人身、财产安全及交易纠纷风险。我们不对上述风险或损失承担责任，您必须自行承担全部责任。
      <br><br>
    </div>
    <div class="T_title">
      11. 其他
    </div>
    <div class="T_content">
      11.1 我们提醒您仔细阅读本协议，尤其是与免责声明、风险、您权利限制及我们责任限制相关的条款。如果您是未成年人，请在监护人陪同下阅读。
      <br><br>
      11.2 您理解并同意，我们在软件中发布的其他声明、规则视为对本规则的补充，是本规则不可分割的组成部分，并与本协议具有同等法律效力。
      <br><br>
      11.3 本协议受香港特别行政区法律管辖，并应根据香港特别行政区法律在所有方面进行解释。因本协议产生或与本协议有关的任何争议，包括关于本协议存在、效力或终止的任何问题，均应提交香港国际仲裁中心并按照其仲裁规则进行仲裁并最终解决。
      <br><br>
      11.4 本协议任何条款无效或不可执行，不应以任何方式影响或损害其余条款的效力或可执行性。如果本协议任何条款被主管机关认定为无效或不可执行，各方应尽最大努力达成替代条款，以实质实现原条款的商业目的。
      <br><br>
    </div>
  </div>
</template>

<style  scoped>
  .agreement {
    padding: 0px 25px;
    font-size: 14px;
    margin-bottom: 14px;
    color: #666666;

    background-color: #fff;
  }
  .T_title {
    font-size: 18px;
    font-weight: 600;
    margin: 1rem 0px;
    color: #666666;
  }
  .T_content {
    font-size: 14px;
    margin-bottom: 12px;
    /* color: #666; */
  }
  .title_content {
    font-size: 12px;
    margin-bottom: 12px;
    color: #666;
    margin-left: 12px;
    margin-right:12px;
  }
</style>
